---
kind: property
id: P:Autodesk.Revit.DB.Structure.StructuralSettings.SymbolicCutbackForBeamAndTruss
source: html/2a88cde1-523e-0f96-4777-801aa82bf488.htm
---
# Autodesk.Revit.DB.Structure.StructuralSettings.SymbolicCutbackForBeamAndTruss Property

Symbolic cutback distance to be applied to all beams and trusses.

## Syntax (C#)
```csharp
public double SymbolicCutbackForBeamAndTruss { get; set; }
```